# CLI Tools — General Utilities
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "coreutils"
brew "dockutil"
brew "fastfetch"
brew "gh"
brew "git"
brew "gnupg"
brew "gum"
brew "htop"
brew "lsd"
brew "lzip"
brew "moreutils"
brew "most"
brew "nano"
brew "nanorc"
brew "ncdu"
brew "nethogs"
brew "nmap"
brew "node@22"
brew "openssh"
brew "osx-cpu-temp"
brew "pwgen"
brew "speedtest-cli"
brew "tealdeer"
brew "topgrade"
brew "zip"
brew "zsh"

# Development
brew "openjdk"
brew "pipx"
brew "pyenv"
brew "python@3.12"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"

# Media
brew "ffmpeg"
brew "sox"

# Applications
cask "4k-video-downloader+"
cask "appcleaner"
cask "audio-hijack"
cask "bitwarden"
cask "brave-browser"
cask "canva"
cask "discord"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "libreoffice"
cask "loopback"
cask "mediainfo"
cask "minecraft"
cask "notunes"
cask "obs"
cask "pearcleaner"
cask "scratch"
cask "soundsource"
cask "steam"
cask "the-unarchiver"
cask "vlc"
cask "whatsapp"
cask "zoom"
